Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.atlantis.helm_release.atlantis will be updated in-place
~ resource "helm_release" "atlantis" {
      ~ id                         = "runatlantis" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.35.0" -> (known after apply)
          ~ chart          = "atlantis" -> (known after apply)
          ~ first_deployed = 1753233833 -> (known after apply)
          ~ last_deployed  = 1753233833 -> (known after apply)
          ~ name           = "runatlantis" -> (known after apply)
          ~ namespace      = "atlantis-system" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                2. Atlantis will not start successfully unless at least one of the following sets of credentials are specified (see values.yaml for detailed usage):
                  - github
                  - githubApp
                  - gitea
                  - gitlab
                  - bitbucket
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "5.18.0" -> (known after apply)
        } -> (known after apply)
        name                       = "runatlantis"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      ~ set                        = [
          ~ {
              ~ name  = "atlantisUrl" -> "extraArgs[0]"
              ~ value = "https://atlantis.billv.ca" -> "--automerge"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ name  = "environmentSecrets[0].secretKeyRef.key" -> "environmentSecrets[0].secretKeyRef.name"
              ~ value = "authentik_api_key" -> "authentik-api-key"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ name  = "environmentSecrets[0].secretKeyRef.name" -> "environmentSecrets[0].secretKeyRef.key"
              ~ value = "authentik-api-key" -> "authentik_api_key"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ name  = "environmentSecrets[1].secretKeyRef.key" -> "environmentSecrets[1].secretKeyRef.name"
              ~ value = "proxmox_password" -> "proxmox-password"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ name  = "environmentSecrets[1].secretKeyRef.name" -> "environmentSecrets[1].secretKeyRef.key"
              ~ value = "proxmox-password" -> "proxmox_password"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ name  = "extraArgs[0]" -> "atlantisUrl"
              ~ value = "--automerge" -> "https://atlantis.billv.ca"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ name  = "orgAllowlist" -> "volumeClaim.storageClassName"
              ~ value = "github.com/billv-ca/homelab-atlantis*" -> "longhorn"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ name  = "volumeClaim.storageClassName" -> "orgAllowlist"
              ~ value = "longhorn" -> "github.com/billv-ca/homelab-atlantis*"
                # (1 unchanged attribute hidden)
            },
            # (5 unchanged elements hidden)
        ]
      - set_list                   = [] -> null
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ set_sensitive              = (sensitive value)
      - set_wo_revision            = 1 -> null
        # (27 unchanged attributes hidden)
    }

  # module.authentik_system.data.kubernetes_service_v1.authentik_server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service_v1" "authentik_server" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "authentik-server"
          + namespace        = "authentik"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.authentik_system.helm_release.authentik will be updated in-place
~ resource "helm_release" "authentik" {
      ~ id                         = "authentik" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2025.6.4" -> (known after apply)
          ~ chart          = "authentik" -> (known after apply)
          ~ first_deployed = 1749241692 -> (known after apply)
          ~ last_deployed  = 1753194184 -> (known after apply)
          ~ name           = "authentik" -> (known after apply)
          ~ namespace      = "authentik" -> (known after apply)
          ~ notes          = <<-EOT
                CHART NAME: redis
                CHART VERSION: 21.1.6
                APP VERSION: 8.0.1
                
                Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
                
                ** Please be patient while the chart is being deployed **
                
                Redis&reg; can be accessed via port 6379 on the following DNS name from within your cluster:
                
                    authentik-redis-master.authentik.svc.cluster.local
                
                
                
                To connect to your Redis&reg; server:
                
                1. Run a Redis&reg; pod that you can use as a client:
                
                   kubectl run --namespace authentik redis-client --restart='Never'  --image docker.io/bitnami/redis:8.0.1-debian-12-r2 --command -- sleep infinity
                
                   Use the following command to attach to the pod:
                
                   kubectl exec --tty -i redis-client \
                   --namespace authentik -- bash
                
                2. Connect using the Redis&reg; CLI:
                   redis-cli -h authentik-redis-master
                
                To connect to your database from outside the cluster execute the following commands:
                
                    kubectl port-forward --namespace authentik svc/authentik-redis-master 6379:6379 &
                    redis-cli -h 127.0.0.1 -p 6379
                
                WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                  - replica.resources
                  - master.resources
                +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                
                Run the commands below to get a kubeconfig file for authentik:
                
                KUBE_API=$(kubectl config view --minify --output jsonpath="{.clusters[*].cluster.server}")
                NAMESPACE=authentik
                SECRET_NAME=$(kubectl get serviceaccount authentik -o jsonpath='{.secrets[0].name}' 2>/dev/null || echo -n "authentik")
                KUBE_CA=$(kubectl -n $NAMESPACE get secret/$SECRET_NAME -o jsonpath='{.data.ca\.crt}')
                KUBE_TOKEN=$(kubectl -n $NAMESPACE get secret/$SECRET_NAME -o jsonpath='{.data.token}' | base64 --decode)
                
                echo "apiVersion: v1
                kind: Config
                clusters:
                - name: default-cluster
                  cluster:
                    certificate-authority-data: ${KUBE_CA}
                    server: ${KUBE_API}
                contexts:
                - name: default-context
                  context:
                    cluster: default-cluster
                    namespace: $NAMESPACE
                    user: authentik-user
                current-context: default-context
                users:
                - name: authentik-user
                  user:
                    token: ${KUBE_TOKEN}"
                
                
                CHART NAME: postgresql
                CHART VERSION: 16.7.4
                APP VERSION: 17.5.0
                
                Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
                
                ** Please be patient while the chart is being deployed **
                
                PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
                
                    authentik-postgresql.authentik.svc.cluster.local - Read/Write connection
                
                To get the password for "postgres" run:
                
                    export POSTGRES_ADMIN_PASSWORD=$(kubectl get secret --namespace authentik authentik-postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
                
                To get the password for "authentik" run:
                
                    export POSTGRES_PASSWORD=$(kubectl get secret --namespace authentik authentik-postgresql -o jsonpath="{.data.password}" | base64 -d)
                
                To connect to your database run the following command:
                
                    kubectl run authentik-postgresql-client --rm --tty -i --restart='Never' --namespace authentik --image docker.io/bitnami/postgresql:17.5.0-debian-12-r3 --env="PGPASSWORD=$POSTGRES_PASSWORD" \
                      --command -- psql --host authentik-postgresql -U authentik -d authentik -p 5432
                
                    > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
                
                To connect to your database from outside the cluster execute the following commands:
                
                    kubectl port-forward --namespace authentik svc/authentik-postgresql 5432:5432 &
                    PGPASSWORD="$POSTGRES_PASSWORD" psql --host 127.0.0.1 -U authentik -d authentik -p 5432
                
                WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
                
                WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                  - primary.resources
                  - readReplicas.resources
                +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
            EOT -> (known after apply)
          ~ revision       = 8 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "2025.6.4" -> (known after apply)
        } -> (known after apply)
        name                       = "authentik"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ set_sensitive              = (sensitive value)
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

  # module.dashboard.helm_release.kube-dashboard will be updated in-place
~ resource "helm_release" "kube-dashboard" {
      ~ id                         = "kubernetes-dashboard" -> (known after apply)
      ~ metadata                   = {
          + app_version    = (known after apply)
          ~ chart          = "kubernetes-dashboard" -> (known after apply)
          ~ first_deployed = 1734616665 -> (known after apply)
          ~ last_deployed  = 1748615980 -> (known after apply)
          ~ name           = "kubernetes-dashboard" -> (known after apply)
          ~ namespace      = "kubernetes-dashboard" -> (known after apply)
          ~ notes          = <<-EOT
                *************************************************************************************************
                *** PLEASE BE PATIENT: Kubernetes Dashboard may need a few minutes to get up and become ready ***
                *************************************************************************************************
                
                Congratulations! You have just installed Kubernetes Dashboard in your cluster.
                
                To access Dashboard run:
                  kubectl -n kubernetes-dashboard port-forward svc/kubernetes-dashboard-kong-proxy 8443:443
                
                NOTE: In case port-forward command does not work, make sure that kong service name is correct.
                      Check the services in Kubernetes Dashboard namespace using:
                        kubectl -n kubernetes-dashboard get svc
                
                Dashboard will be available at:
                  https://localhost:8443
                
                
                
                To connect to Kong, please execute the following commands:
                export PROXY_IP=${HOST}:${PORT}
                curl $PROXY_IP
                
                Once installed, please follow along the getting started guide to start using
                Kong: https://docs.konghq.com/kubernetes-ingress-controller/latest/guides/getting-started/
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "7.13.0" -> (known after apply)
        } -> (known after apply)
        name                       = "kubernetes-dashboard"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

  # module.k8s_amd_gpu.helm_release.k8s-device-plugin will be updated in-place
~ resource "helm_release" "k8s-device-plugin" {
      ~ id                         = "amd-gpu" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.31.0.7" -> (known after apply)
          ~ chart          = "amd-gpu" -> (known after apply)
          ~ first_deployed = 1749328327 -> (known after apply)
          ~ last_deployed  = 1750941343 -> (known after apply)
          ~ name           = "amd-gpu" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          ~ notes          = <<-EOT
                amd-gpu-device-plugin-daemonset deployed in namespace 'default'
            EOT -> (known after apply)
          ~ revision       = 2 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "0.20.0" -> (known after apply)
        } -> (known after apply)
        name                       = "amd-gpu"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

  # module.longhorn_system.helm_release.longhorn will be updated in-place
~ resource "helm_release" "longhorn" {
      ~ id                         = "longhorn" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.9.0" -> (known after apply)
          ~ chart          = "longhorn" -> (known after apply)
          ~ first_deployed = 1732591142 -> (known after apply)
          ~ last_deployed  = 1748352726 -> (known after apply)
          ~ name           = "longhorn" -> (known after apply)
          ~ namespace      = "longhorn-system" -> (known after apply)
          ~ notes          = <<-EOT
                Longhorn is now installed on the cluster!
                
                Please wait a few minutes for other Longhorn components such as CSI deployments, Engine Images, and Instance Managers to be initialized.
                
                Visit our documentation at https://longhorn.io/docs/
            EOT -> (known after apply)
          ~ revision       = 9 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "1.9.0" -> (known after apply)
        } -> (known after apply)
        name                       = "longhorn"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

  # module.pihole_system.helm_release.pihole will be updated in-place
~ resource "helm_release" "pihole" {
      ~ id                         = "pihole" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2025.04.0" -> (known after apply)
          ~ chart          = "pihole" -> (known after apply)
          ~ first_deployed = 1742521564 -> (known after apply)
          ~ last_deployed  = 1750379810 -> (known after apply)
          ~ name           = "pihole" -> (known after apply)
          ~ namespace      = "pihole-system" -> (known after apply)
          ~ notes          = <<-EOT
                Pi-hole Helm Chart Deployment
                
                1. Pi-hole Deployment Information:
                   - Release Name: pihole
                   - Namespace: pihole-system
                   - Chart Name: pihole
                   - Chart Version: 2.31.0
                
                2. Pi-hole Service Information:
                   - Service Name: pihole-web
                   - Service Type: ClusterIP
                   - Service Port: 80/443 TCP
                
                   - Service Name: pihole-dns-tcp
                   - Service Type: NodePort
                   - Service Port: 53 TCP
                
                   - Service Name: pihole-dns-udp
                   - Service Type: NodePort
                   - Service Port: 53 UDP
                
                   - Service Name: pihole-dhcp
                   - Service Type: NodePort
                   - Service Port: 67 UDP
                
                3. Accessing Pi-hole:
                   !!! This chart does not create a Loadbalancer for pihole by default. Please
                   create a configuration that is tailored to your setup. Especially the DNS
                   and DHCP services are system services that require a dedicated setup based
                   on your system !!!
                
                   Find more information in the wiki:
                   https://github.com/MoJo2600/pihole-kubernetes/wiki/Pi%E2%80%90hole
                
                4. Useful Commands:
                   - Check the Pi-hole Deployment Status:
                     helm status pihole
                
                   - Get Detailed Information about the Pi-hole Deployment:
                     helm get all pihole
                
                5. Clean Up:
                   - To uninstall/delete the Pi-hole deployment, run:
                     helm uninstall pihole
            EOT -> (known after apply)
          ~ revision       = 13 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "2.31.0" -> (known after apply)
        } -> (known after apply)
        name                       = "pihole"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
╷
│ Warning: UpgradeState Triggered
│ 
│   with module.atlantis.helm_release.atlantis,
│   on modules/atlantis-system/main.tf line 162, in resource "helm_release" "atlantis":
│  162: resource "helm_release" "atlantis" {
│ 
│ Successfully migrated state from SDKv2 to Plugin Framework
│ 
│ (and 5 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 6 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```